Repository: GEWIS/gewisdb
Catalog: module/Application/language/*.po
Languages: nl

source: # Decisions
nl: # besluiten

source: %d pending mailing list subscriptions
nl: %d geplande maillijst-aanmeldingen

source: %d pending mailing list unsubscriptions
nl: %d geplande maillijst-afmeldingen

source: %s has been added to %s
nl: %s toegevoegd aan %s

source: %s prospective member(s) have paid and are pending approval.
nl: %s toekomstig lid heeft/leden hebben betaald en wachten op goedkeuring.

source: %s: %s (started in %s)
nl: %s: %s (begonnen in %s)

source: (Annulled by decision %s %d.%d.%d)
nl: (Vernietigd door besluit %s %d.%d.%d)

source: <strong>Warning:</strong> The database currently requires the usage of GEWIS m-accounts to log in. Any accounts created here cannot be used to log in. Learn more about m-accounts %shere%s.
nl: <strong>Waarschuwing:</strong> De database vereist momenteel het gebruik van GEWIS m-accounts om in te loggen. Hier aangemaakte accounts kunnen niet worden gebruikt om in te loggen. Meer informatie over m-accounts kun je %shier%s vinden.

source: A 404 error occurred
nl: Er is een 404-fout opgetreden

source: A Mailman sync is currently in progress. It is now not possible to safely update the mailing list administration, please try again in a few minutes.
nl: Een Mailman synchronisatie vindt op dit moment plaats; het is op dit moment niet mogelijk om wijzigingen uit te voeren. Probeer het over een paar minuten opnieuw.

source: A TU/e-username should look like sYYxxxx or YYYYxxxx.
nl: Een TU/e-gebruikersnaam ziet er uit als sYYxxxx of als YYYYxxxx.

source: API Tokens
nl: API-token

source: API principal
nl: API-gebruiker

source: API principals
nl: API-gebruikers

source: Abbreviation
nl: Afkorting

source: Abolish Organ
nl: Hef orgaan op

source: Abolition
nl: Opheffing

source: According to our data it is time to renew your status as a graduate of GEWIS. To make sure we have up-to-date information on how to contact you, please review your details below.<br/> If you do not want to become or remain a graduate, you do not have to do anything. It will simply expire on the indicated date.
nl: Volgens onze gegevens is het tijd om je status als afgestudeerde van GEWIS te verlengen. Om te zorgen dat we actuele contactgegevens hebben, vragen we je onderstaande gegevens te controleren.<br/> Als je geen afgestudeerde wilt worden of blijven, hoef je niets te doen. Je afgestudeerde-status verloopt dan op de in de e-mail aangegeven datum.

source: Action
nl: Actie

source: Add %s of %s
nl: Voeg %s van %s toe

source: Add Budget/Statement
nl: Voeg budget/afrekening toe

source: Add Decision
nl: Voeg besluit toe

source: Add Home Address
nl: Voeg thuisadres toe

source: Add Inactive Member
nl: Voeg inactief lid toe

source: Add Mail Address
nl: Voeg postadres toe

source: Add Mailing List
nl: Voeg mailinglijst toe

source: Add Meeting
nl: Voeg vergadering toe

source: Add Member
nl: Voeg lid toe

source: Add New (Inactive) Member
nl: Voeg nieuw (inactief) lid toe

source: Add New Decision
nl: Voeg nieuw besluit toe

source: Add New Mailing List
nl: Voeg nieuwe mailinglijst toe

source: Add New Meeting
nl: Voeg nieuwe vergadering toe

source: Add Organ Regulation
nl: Voeg orgaanreglement toe

source: Add Student Address
nl: Voeg kameradres toe

source: Add new user
nl: Nieuwe gebruiker toevoegen

source: Additional information
nl: Meer informatie

source: Address
nl: Adres

source: Addresses
nl: Adressen

source: Administrative Functions
nl: Administratieve functies

source: Agreement
nl: Akkoordverklaring

source: All API permissions
nl: Alle API-rechten

source: An error occurred
nl: Er is een fout opgetreden

source: An error occurred while we were trying to prepare the checkout page. Please try again later.
nl: Er is een fout opgetreden terwijl we probeerden de afrekenpagina voor te bereiden. Probeer het later nog eens.

source: An error occurred while we were trying to prepare the checkout page. We have received your registration and sent you an e-mail containing a link that allows you to restart the checkout process at a later time.
nl: Er is een fout opgetreden terwijl we probeerden de afrekenpagina voor te bereiden. We hebben je registratie ontvangen en je een e-mail gestuurd met een link waarmee je het betalingsproces op een later tijdstip opnieuw kunt starten.

source: Annul Decision
nl: Vernietig Besluit

source: Apply Update
nl: Update toepassen

source: Approval
nl: Goedkeuring

source: Approve
nl: Goedkeuren

source: Approve Membership
nl: Lidmaatschap goedkeuren

source: Are you sure %s?
nl: Weet je het zeker %s?

source: Are you sure that you are younger than 10 years?
nl: Weet je zeker dat je jonger bent dan 10 jaar?

source: Are you sure that you want to delete decision %s %d.%d.%d?
nl: Weet je zeker dat je besluit %s %d.%d.%d wilt verwijderen?

source: Are you sure that you want to delete the %s mailing list?
nl: Weet je zeker dat je de %s mailinglijst wilt verwijderen?

source: Are you sure that you want to delete the %s of %s?
nl: Weet je zeker dat je %s van %s wilt verwijderen?

source: Are you sure that you want to extend the membership of %s to %s (from %s)?
nl: Weet je zeker dat je het lidmaatschap van %s wilt verlengen tot %s (van %s)?

source: Are you sure that you want to remove %s?
nl: Weet je zeker dat je %s wilt verwijderen?

source: Are you sure that you want to remove %s? Because they have already paid a refund will be requested. If this fails, the prospective member will NOT be removed.
nl: Weet je zeker dat je %s wilt verwijderen? Omdat ze al betaald hebben, zal er een terugbetaling worden aangevraagd. Als dit niet lukt, wordt het toekomstige lid NIET verwijderd.

source: Are you sure you want to delete member %s?
nl: Weet je zeker dat je lid %s wilt verwijderen?

source: Articles of Association, Internal Regulations and privacy statement
nl: Statuten, huishoudelijk reglement en privacystatement

source: Articles of Association, Internal Regulations, and Privacy Statement of GEWIS
nl: Statuten, Huishoudelijk Reglement en Privacystatement van GEWIS

source: As a GEWIS member, you are automatically subscribed to the "announcements" mailing list. This list is used solely for announcements from the study association, such as invitations to General Members Meetings (GMMs). In addition, there are several other optional mailing lists. You can subscribe to the following mailing lists. These subscriptions can be changed at a later date.
nl: Als GEWIS-lid ben je automatisch ingeschreven op de mailinglijst "announcements". Deze lijst wordt alleen gebruikt voor mededelingen van de studievereniging, zoals uitnodigingen voor Algemene Ledenvergaderingen (ALV's). Daarnaast zijn er verschillende andere optionele mailinglijsten. Je kunt je aanmelden voor de volgende mailinglijsten. Deze aanmeldingen kunnen later gewijzigd worden.

source: As a graduate, you can choose to keep receiving the physical Supremum magazine.
nl: Als afgestudeerde kun je ervoor kiezen om de Supremum te blijven ontvangen.

source: As a result, this member cannot be removed. According to the AVG, we have a legal basis to keep this member's name in our database. The other data can, however, be deleted.
nl: Daardoor kan dit lid niet worden verwijderd. Volgens de AVG hebben wij een wettelijke grondslag om de naam van dit lid in onze database te bewaren. De overige gegevens kunnen wel worden verwijderd.

source: Author
nl: Auteur

source: Auto-subscription
nl: Automatische inschrijving

source: Awesome!
nl: Fantastisch!

source: BM (Board Meeting)
nl: BV (bestuursvergadering)

source: Back to %s %d
nl: Terug naar %s %d

source: Before submitting the registration form, please review the
nl: Lees voordat je het registratieformulier verzendt de

source: Birthdate
nl: Geboortedatum

source: Board Member(s) to Discharge
nl: Bestuurder(s) om te dechargeren

source: Board Member(s) to Relieve
nl: Bestuurder(s) om te ontheffen

source: Board Mutations
nl: Bestuursmutaties

source: Boards - List functions and translations
nl: Bestuur - Functie- en vertalingenlijst bekijken

source: Budget
nl: Begroting

source: Budget/Statement
nl: Begroting/Afrekening

source: CM (Chair's Meeting)
nl: VV (voorzittersvergadering)

source: Cancelled
nl: Afgebroken

source: Cannot Delete Prospective Member:
nl: Kan toekomstig lid niet verwijderen:

source: Category
nl: Categorie

source: Change
nl: Wijzig

source: Change Data
nl: Gegevens wijzigingen

source: Change Mailing List Subscriptions of %s
nl: Mailinglijst abonnementen van %s wijzigen

source: Change Membership Type
nl: Lidmaatschapstype wijzigen

source: Change Membership Type of %s
nl: Lidmaatschapstype van %s wijzigen

source: Change Subscriptions
nl: Abonnementen wijzigen

source: Change password for %s
nl: Wachtwoord voor %s wijzigen

source: Change(s) of %s have been approved and saved!
nl: Wijzigingen van %s zijn goedgekeurd en opgeslagen!

source: Change(s) of %s have been rejected!
nl: Wijzigingen van %s zijn afgekeurd!

source: Change(s) of %s have been saved!
nl: Wijzigingen van %s zijn opgeslagen!

source: Check out the website of Ada Alumni <a href="//%s" target="_blank">here</a>.
nl: Klik <a href="//%s" target="_blank">hier</a> om naar de website van Ada Alumni te gaan.

source: Checkout Status
nl: Afrekenstatus

source: Choose a mailing list
nl: Kies een maillijst

source: City
nl: Stad

source: City and Postal Code
nl: Stad en postcode

source: Click here for approval if membership fee paid with cash.
nl: Klik hier voor goedkeuring als de eenmalige lidmaatschapsbijdrage contant is betaald.

source: Confirm Changes
nl: Wijzigingen bevestigen

source: Copy Decision
nl: Besluit kopiëren

source: Could not add new %s!
nl: Kan nieuw %s niet toevoegen!

source: Could not delete %s!
nl: Kon %s niet verwijderen!

source: Could not find %s!
nl: Kan %s niet vinden!

source: Could not reject change(s) of %s!
nl: Kon wijzigingen van %s niet afkeuren!

source: Could not save change(s) of %s!
nl: Kon wijzigingen van %s niet opslaan!

source: Create API principal
nl: Maak API-gebruiker aan

source: Create API token
nl: Maak API-token

source: Create new API principal
nl: Nieuwe API-gebruiker

source: Create user
nl: Maak nieuwe gebruiker aan

source: Created
nl: Aangemaakt

source: Created / Pending
nl: Aangemaakt / In behandeling

source: Current Data
nl: Huidige gegevens

source: Current Functions
nl: Huidige functies

source: Current Mailing Lists
nl: Huidige mailinglijsten

source: Current Members
nl: Huidige leden

source: Data Update Requests
nl: Verzoeken om persoonsgegevens bij te werken

source: Date of Budget/Statement
nl: Datum begroting/afrekening

source: Date of Expiration
nl: Afloopdatum

source: Date of Organ Regulation
nl: Datum orgaanreglement

source: Decision
nl: Besluit

source: Decision Already Exists
nl: Besluit bestaat al

source: Decision Cannot Be Removed
nl: Besluit kan niet worden verwijderd

source: Decision List
nl: Besluitenlijst

source: Decision Number
nl: Besluitnummer

source: Decision removed.
nl: Besluit verwijderd.

source: Decisions
nl: Besluiten

source: Delete
nl: Verwijder

source: Delete %s
nl: Verwijder %s

source: Delete Decision
nl: Besluit verwijderen

source: Delete Member
nl: Lid verwijderen

source: Delete Prospective Member
nl: Toekomstig lid verwijderen

source: Delete User
nl: Gebruiker verwijderen

source: Description
nl: Beschrijving

source: Disapprove
nl: Afkeuren

source: Discharge
nl: Dechargeer

source: Discharge %s as %s?
nl: Dechargeer %s als %s?

source: Discharge Board Member
nl: Bestuurder dechargeren

source: Discharge Member
nl: Lid dechargeren

source: Discharges
nl: Decharges

source: Do you want to delete the other data?
nl: Wil je de andere gegevens verwijderen?

source: Do you want to reappoint %s? Check functions you also want reappointed, functions that are not selected will result in a discharge of that function.
nl: Wil je %s herbenoemen? Vink functies aan die je ook wilt herbenoemen, functies die niet zijn geselecteerd zullen resulteren in een decharge van die functie.

source: Dutch Description
nl: Nederlandse beschrijving

source: E-mail Address
nl: E-mailadres

source: Edit
nl: Bewerk

source: Edit / Delete
nl: Bewerken / Verwijderen

source: Edit Mailing List
nl: Bewerk maillijst

source: Effective From
nl: Vanaf

source: English Description
nl: Engelse beschrijving

source: Execute
nl: Uitvoeren

source: Expiration
nl: Afloopdatum

source: Expired
nl: Verlopen

source: Expired / Failed
nl: Verlopen / Mislukt

source: Export
nl: Exporteren

source: Export Decisions
nl: Besluiten exporteren

source: Extend
nl: Verleng

source: Extend Membership of %s
nl: Lidmaatschap van %s verlengen

source: External
nl: Extern

source: External - Specially admitted by the board
nl: Extern - Speciaal toegelaten door het bestuur

source: Failed
nl: Mislukt

source: File
nl: Bestand

source: First Name
nl: Voornaam

source: For an overview of how you can use the Doctrine Query Language (DQL) please refer to %sits documentation%s.
nl: Voor een overzicht van hoe je de Doctrine Query Language (DQL) kunt gebruiken, zie %sde documentatie%s.

source: Fork GEWISDB on GitHub &raquo;
nl: Fork GEWISDB op GitHub &raquo;

source: Found Organ
nl: Orgaan oprichten

source: Foundation
nl: Oprichting

source: Function
nl: Functie

source: Function of
nl: Functie van

source: Functions
nl: Functies

source: GEWIS Registration - Checkout
nl: GEWIS Inschrijven - Afrekenen

source: GEWIS currently has <a href="%s">%d members and %d graduates</a> (+%d expired) and <a href="%s">%d prospective members (%d paid, %d unpaid)</a>. <a href="%s">Click here</a> to create a meeting or <a href="%s">perform a query</a>.
nl: GEWIS heeft momenteel <a href="%s">%d leden en %d afgestudeerden</a> (+%d verlopen) en <a href="%s">%d toekomstige leden (%d betaald, %d onbetaald)</a>. <a href="%s">Klik hier</a> om een vergadering te maken of om een <a href="%s">query uit te voeren</a>.

source: GMM (General Members Meeting)
nl: ALV (algemene ledenvergadering)

source: Generation
nl: Generatie

source: Get API Health
nl: API-status ophalen

source: Get active Members (members that are in one or more organs)
nl: Bekijk actieve leden (leden die in één of meer organen zijn geïnstalleerd)

source: Get all Members
nl: Alle leden ophalen

source: Give Function
nl: Geef functie

source: Give Member Function
nl: Geef lid functie

source: Go to checkout
nl: Afrekenen

source: Graduate
nl: Afgestudeerde

source: Graduate - Old member and specially admitted by the board
nl: Afgestudeerde - Oud lid en speciaal toegelaten door het bestuur

source: Graduate renewal
nl: Verlengen afgestudeerde

source: Grant
nl: Toekennen

source: Grant Key Code
nl: Sleutelcode toekennen

source: Grantee
nl: Verkrijger

source: Hide Member
nl: Lid verbergen

source: Historic Functions
nl: Historische functies

source: Home Address (Parents)
nl: Thuisadres (ouders)

source: Honorary
nl: Erelid

source: Honorary - Specially appointed by the GMM
nl: Erelid - Speciaal benoemd door de ALV

source: House Number
nl: Huisnummer

source: I am familiar with the contents of the Articles of Association and the Internal Regulations of GEWIS and I would like to renew my status as a graduate
nl: Ik ben bekend met de inhoud van de statuten en het huishoudelijk reglement van GEWIS en wil graag mijn status als afgestudeerde verlengen

source: I have read the privacy statement of %s and consent to the processing of my data.
nl: Ik ben bekend met de privacystatement van %s en ga akkoord met het verwerken van mijn data.

source: I hereby authorise Stripe to process my personal data according to its privacy policy to pay the one-time membership fee.
nl: Hierbij geef ik Stripe toestemming om mijn persoonlijke gegevens te verwerken in overeenstemming met haar privacybeleid om de eenmalige lidmaatschapsbijdrage te betalen.

source: I hereby declare to have filled in the form truthfully and agree to be a member of Study Association GEWIS. I am familiar with the contents of the Articles of Association and Internal Regulations. I hereby give also Gemeenschap van Wiskunde en Informatica Studenten (GEWIS) permission to process my personal data according to its Privacy Policy.
nl: Hierbij verklaar ik het formulier naar waarheid te hebben ingevuld en ga ik ermee akkoord lid te zijn van Studievereniging GEWIS. Ik ben bekend met de inhoud van de Statuten en het Huishoudelijk Reglement. Hierbij geef ik ook Gemeenschap van Wiskunde en Informatica Studenten (GEWIS) toestemming om mijn persoonlijke gegevens te verwerken volgens haar privacybeleid.

source: I'd like to receive the Supremum magazine 3 times a year
nl: Ik ontvang graag de Supremum driemaal per jaar

source: If you are currently studying at TU/e, please do <u>not</u> fill in this form, but instead inform the secretary of this. If you want GEWIS to automatically renew your membership, please send your TU/e username.
nl: Als je momenteel aan de TU/e studeert, vul dan alsjeblieft <u>niet</u> dit formulier in, maar laat het weten aan de secretaris. Ook is het mogelijk om je lidmaatschap automatisch te verlengen zolang je aan de TU/e studeert; stuur daarvoor je TU/e-gebruikersnaam op.

source: If you are reading this, the secretary has not done their job.
nl: Als je dit leest, heeft de secretaris zijn/haar werk niet gedaan.

source: If you have any questions feel free to contact
nl: Als je vragen hebt, neem gerust contact op met

source: If you started after 2016, your username is an 8-digit number starting with the year you started at the TU/e, for example %s0001. You have received this in an email when you enrolled. Go to <a href="%s">this page</a> if you need help finding it. Your username will be used to verify you are studying at the department of M&CS.
nl: Studeerde je voor het eerst na 2016? Dan is je gebruikersnaam een getal van 8 cijfers waarvan de eerste 4 het jaar zijn waarin je begon met studeren, bijvoorbeeld %s0001. Je hebt je gebruikersnaam ontvangen in een e-mail toen je je ingeschreven hebt aan de TU/e. Op <a href="%s">deze pagina</a> staat hoe je je gebruikersnaam kunt vinden. We gebruiken je gebruikersnaam om te verifiëren dat je aan de faculteit van M&CS studeert.

source: If your browser does not redirect you, please <a href="%s">click here</a> to continue.
nl: Als je browser je niet doorverwijst, <a href="%s">klik dan hier</a> om verder te gaan.

source: Initial(s)
nl: Initialen

source: Install Board Member
nl: Bestuurder installeren

source: Installation
nl: Installatie

source: Installation/Discharge
nl: Installatie/Decharge

source: Installations
nl: Installaties

source: Key
nl: Sleutel

source: Key Code(s) to Withdraw
nl: Sleutelcode(s) om in te trekken

source: Key Codes
nl: Sleutelcodes

source: Key code cannot be granted after September 1st of the next association year.
nl: Sleutelcode kan niet na 1 september van het volgende verenigingsjaar worden toegekend.

source: Key code cannot be granted in the past.
nl: Sleutelcode kan niet in het verleden worden toegekend.

source: Key code cannot be withdrawn after its original expiration.
nl: Sleutelcode kan niet worden ingetrokken nadat deze is vervallen.

source: Key code cannot be withdrawn in the past.
nl: Sleutelcode kan niet met terugwerkende kracht worden ingetrokken.

source: LEGACY Onderwijscommissaris
nl: Onderwijscommissaris

source: Language Settings
nl: Taalinstellingen

source: Last Name
nl: Achternaam

source: Last Name Prepositional Particle
nl: Tussenvoegsel

source: Last Update to Membership
nl: Laatste aanpassing van het lidmaatschap

source: Last fetch of available mailman lists was %s.
nl: Beschikbare Mailman lijsten voor het laatst om %s opgehaald.

source: Last fetch of mailman lists
nl: Mailman lijsten voor het laatst opgehaald

source: Leave note
nl: Voeg notitie toe

source: Lists
nl: Lijsten

source: Log in
nl: Inloggen

source: Log out
nl: Uitloggen

source: Login
nl: Inloggen

source: Mail Address
nl: Postadres

source: Mailing List Subscriptions
nl: Abonnementen op mailinglijsten

source: Mailing Lists
nl: Mailinglijsten

source: Mailing list deleted.
nl: Mailinglijst verwijderd.

source: Mailman Mailing List
nl: Mailman-maillijst

source: Mailman lists not being fetched
nl: Mailman lijsten worden niet opgehaald

source: Mailman sync
nl: Mailman-synchronisatie

source: Make %s inactive?
nl: %s inactief maken?

source: Make Inactive
nl: Maak inactief

source: Make Member Inactive
nl: Maak lid inactief

source: Meeting
nl: Vergadering

source: Meeting Date
nl: Vergaderdatum

source: Meeting Number
nl: Vergadernummer

source: Meeting Type
nl: Type vergadering

source: Meeting added successfully!
nl: Vergadering succesvol toegevoegd!

source: Meetings
nl: Vergaderingen

source: Meetings and Decisions
nl: Vergaderingen en besluiten

source: Member %s cannot be deleted.
nl: Lid %s kan niet worden verwijderd.

source: Member Number
nl: Lidmaatschapsnummer

source: Members
nl: Leden

source: Membership Ends On (Expires On)
nl: Lidmaatschap eindigt op (verloopt op)

source: Membership Type
nl: Lidmaatschapstype

source: Membership of Committees and Fraternities
nl: Lidmaatschap van commissies en disputen

source: Member¹ - Allow operations on `deleted' members
nl: Lid¹ - Acties op `verwijderde' leden toestaan

source: Member¹ - Check if has reached age 16
nl: Lid¹ - Controleer of lid ten minste 16 jaar is

source: Member¹ - Check if has reached age 18
nl: Lid¹ - Controleer of lid ten minste 18 jaar is

source: Member¹ - Check if has reached age 21
nl: Lid¹ - Controleer of lid ten minste 21 jaar is

source: Member¹ - Check if keyholder
nl: Lid¹ - Controleer of lid sleutelhouder is

source: Member¹ - Check membership type
nl: Lid¹ - Lidmaatschapstype inzien

source: Member¹ - Get birthdate
nl: Lid¹ - Geboortedatum inzien

source: Member¹ - Get email address
nl: Lid¹ - E-mailadres inzien

source: Message
nl: Bericht

source: Minutes
nl: Notulen

source: Mistake?
nl: Foutje?

source: Modifications
nl: Wijzigingen

source: Mutations
nl: Mutaties

source: Name
nl: Naam

source: Name (Mailman)
nl: Naam (Mailman)

source: No
nl: Nee

source: No Checkout Sessions on record.
nl: Er zijn geen afrekensessies geregistreerd.

source: No Exception available
nl: Geen exceptie beschikbaar

source: No category
nl: Zonder categorie

source: No data returned.
nl: Geen gegevens ontvangen.

source: No mailing list subscriptions.
nl: Geen aanmeldingen voor mailinglijsten.

source: Note
nl: Notitie

source: Note: if you updated your email address, you have to sign in to the GEWIS website using your new email address once this change has been processed.
nl: Let op: als je je emailadres hebt aangepast, moet je na het verwerken van deze wijziging met je nieuwe emailadres inloggen op de GEWIS-website.

source: Notes
nl: Notities

source: Oh snap!
nl: Oh nee!

source: On Form
nl: Op inschrijfformulier

source: Ordinary
nl: Gewoon

source: Ordinary - Enrolled at the department of M&CS
nl: Gewoon - Ingeschreven bij de faculteit M&CS

source: Organ
nl: Orgaan

source: Organ Mutations
nl: Orgaanmutaties

source: Organ Regulation
nl: Orgaanreglement

source: Organ regulations can only be created for 'committee', 'fraternity', or 'financial audit committee'.
nl: Orgaanreglementen kunnen alleen worden aangemaakt voor 'commissie', 'dispuut' of 'kas controle commissie'.

source: Organs - List functions and translations
nl: Organen - Functie- en vertalingenlijst bekijken

source: Organs - Read organ membership (per user/organ)
nl: Organen - Orgaanlidmaatschap ophalen (per gebruiker/orgaan)

source: Other
nl: Overig

source: PS: Did you know we have an alumni foundation at the department of M&amp;CS?
nl: PS: Wist je dat de faculteit W&amp;I een alumni-stichting heeft?

source: Paid
nl: Betaald

source: Paid (Amount)
nl: Betaald (bedrag)
