Repository: GEWIS/gewisdb
Catalog: module/Application/language/*.po
Languages: nl

source: Payment of the one-time membership fee is handled by Stripe, please review the
nl: De betaling van de eenmalige lidmaatschapsbijdrage wordt afgehandeld door Stripe, lees het

source: Pending
nl: In behandeling

source: Pending member updates
nl: Openstaande updates persoonsgegevens

source: Permissions
nl: Rechten

source: Personal details
nl: Persoonlijke informatie

source: Phone Number
nl: Telefoonnummer

source: Please check your e-mail address, '%s' does not appear to be able to receive e-mails. If you are certain that your e-mail address is correct, please contact the board.
nl: Controleer je e-mailadres, '%s' lijkt geen e-mails te kunnen ontvangen. Als je zeker weet dat je e-mailadres correct is, neem dan contact op met het bestuur.

source: Please select a function
nl: Selecteer een functie

source: Point
nl: Punt

source: Possibly, the mailing list server is down or fetch mechanism is malfunctioning.
nl: Mogelijk is de maillijst-server offline or is er een storing bij het ophalen van de lijsten.

source: Postal Code
nl: Postcode

source: Postal Region
nl: Postregio

source: Privacy Policy of Stripe
nl: Privacybeleid van Stripe

source: Proposed Data
nl: Voorgestelde gegevens

source: Prospective Members
nl: Toekomstige leden

source: Provided Data
nl: Geleverde gegevens

source: Query Result
nl: Queryresultaat

source: Reappoint
nl: Herbenoemen

source: Reappoint Member
nl: Lid herbenoemen

source: Reappointments
nl: Herbenoemingen

source: Register Member
nl: Lid inschrijven

source: Registration
nl: Inschrijven

source: Reject Update
nl: Update afwijzen

source: Relieve
nl: Ontheffen

source: Relieve Board Member
nl: Bestuurder ontheffen

source: Remove Member
nl: Lid verwijderen

source: Remove Prospective Member
nl: Verwijder toekomstig lid

source: Renew
nl: Verleng

source: Renew until
nl: Verleng tot en met

source: Renewal
nl: Verlenging

source: Result
nl: Resultaat

source: Return to registration form
nl: Terug naar inschrijfformulier

source: Sadly, during the month of July we are not able to verify your enrollment at TU/e. Therefore, it is not possible to register for GEWIS at this time. <br/>We would love to welcome you as a member starting on August 1st. If you were already studying at TU/e before the summer break, please reach out to the secretary on the email address below.
nl: Helaas kunnen we in de maand juli niet verifiëren of je studeert aan de TU/e. Daarom is het op dit moment niet mogelijk om je te registreren als lid van GEWIS.<br/>Vanaf 1 augustus verwelkomen we je weer als lid van GEWIS. Mocht je voor de zomer al aan de TU/e gestudeerd hebben, neem dan contact op met de secretaris van GEWIS op het onderstaande e-mailadres.

source: Save
nl: Opslaan

source: Saving a query with a previously used name will overwrite the previously saved query and update its category.
nl: Het opslaan van een query met een eerder gebruikte naam zal de eerder opgeslagen query overschrijven en de categorie aanpassen.

source: Search
nl: Zoek

source: Search Members
nl: Leden zoeken

source: Search Organs
nl: Organen zoeken

source: Search Prospective Members
nl: Toekomstige leden zoeken

source: Search TU/e Students
nl: TU/e-studenten zoeken

source: Select API permissions
nl: Selecteer API-rechten

source: Select Postal Region
nl: Selecteer een postregio

source: Select a study
nl: Selecteer een studie

source: Settings
nl: Instellingen

source: Some of the entered information appears to be missing or incorrect. Please check your data and submit again.
nl: Een deel van de ingevoerde informatie lijkt te missen of is onjuist. Controleer de data en verstuur het formulier opnieuw.

source: Starting 2024, organ installation functions can only be changed through the code
nl: Vanaf 2024 is het slechts mogelijk om orgaan-functies aan te passen in de GEWISDB-code

source: Statement
nl: Afrekening

source: Stored Queries
nl: Opgeslagen query's

source: Street
nl: Straat

source: Street and House Number
nl: Straat en huisnummer

source: Student Address
nl: Kameradres

source: Study
nl: Studie

source: Submit
nl: Verstuur

source: Subscribe
nl: Inschrijven

source: Succesfully created %s!
nl: Succesvol %s gemaakt!

source: Succesfully deleted %s!
nl: %s succesvol verwijderd!

source: Sync in progress
nl: Synchronisatie bezig

source: Synchronisation paused
nl: Synchronisatie gepauzeeerd

source: Synchronisation with other systems is paused and will resume in %d minutes.
nl: Synchronisatie met andere systemen is onderbroken en wordt hervat over %d minuten.

source: Synchronisation with other systems is paused until %s.
nl: Synchronisatie met andere systemen is onderbroken tot %s.

source: TU/e Data
nl: TU/e gegevens

source: TU/e Raw Data Lookup
nl: TU/e gegevens opzoeken

source: TU/e-username
nl: TU/e-gebruikersnaam

source: Thank you %s!
nl: Bedankt %s!

source: The database currently is in demo mode and uses environment credentials.
nl: De database is in demo-modus en gebruikt de environment-inloggegevens.

source: The database currently only accepts logins using your GEWIS m-account.
nl: De database accepteert momenteel alleen aanmeldingen met jouw GEWIS m-account.

source: The database currently only accepts logins using your database credentials.
nl: De database accepteert momenteel alleen aanmeldingen met jouw databasegegevens.

source: The entities that you can use:
nl: De entiteiten die je kunt gebruiken:

source: The organ to be abolished includes the following members:
nl: Het op te heffen orgaan heeft de volgende leden:

source: The query did not return any results.
nl: De query leverde geen resultaten op.

source: The requested URL could not be matched by routing.
nl: Er is geen route gevonden die overeenkomt met de opgevraagde URL.

source: The requested controller could not be mapped to an existing controller class.
nl: Er is geen mapping beschikbaar voor de opgevraagde controller.

source: The requested controller was not dispatchable.
nl: De opgevraagde controller is niet bruikbaar.

source: The requested controller was unable to dispatch the request.
nl: De opgevraagde controller kon deze aanvraag niet verwerken.

source: There are
nl: Er zijn

source: There are currently no data update requests.
nl: Er zijn momenteel geen verzoeken om gegevens bij te werken.

source: There are no notes for this member.
nl: Dit lid heeft geen notities.

source: There are no saved queries.
nl: Er zijn geen opgeslagen queries.

source: There are other decisions that still refer to this decision.
nl: Er zijn nog andere besluiten die naar dit besluit verwijzen.

source: There are too many results to display. Try filtering to see other results.
nl: Er zijn te veel resultaten om weer te geven. Probeer te filteren om andere resultaten te zien.

source: There is currently <a href="%s">%d update</a> pending approval.
nl: Er is momenteel <a href="%s">%d update</a> in afwachting van goedkeuring.

source: These organ functions can be selected when installing someone into a committee/fraternity
nl: Deze functies zijn beschikbaar tijdens installaties

source: These organ functions cannot be selected manually but are used by the database internally
nl: Deze functies worden intern gebruikt, maar kunnen niet handmatig geselecteerd worden

source: These organ functions were used in the past but can no longer be selected
nl: Deze functies zijn in het verleden gebruikt en kunnen niet langer geselecteerd worden

source: This is because %s is/has been a member of an organ and/or has budgets/statements to their name.
nl: Dit komt omdat %s lid is (geweest) van een orgaan en/of begrotingen/afrekeningen op zijn naam heeft staan.

source: This meeting has no decisions (yet).
nl: Deze vergadering heeft (nog) geen besluiten.

source: This member has been deleted, you cannot edit their information. Only the name of this member is stored so that decisions that mention this member remain correct.
nl: Dit lid is verwijderd, je kunt de gegevens niet aanpassen. Alleen de naam van dit lid is opgeslagen zodat de besluiten waarbij dit lid betrokken is correct blijven.

source: This member is not installed in an organ.
nl: Dit lid is niet lid van een orgaan.

source: This payment link could not be found. Perhaps it has been used before or has expired.
nl: Deze betaallink kon niet worden gevonden. Misschien is deze al eerder gebruikt of is deze verlopen.

source: This permission will add more properties to existing entities that can already be requested.
nl: Dit API-recht voegt meer attributen toe aan objecten die al opgehaald kunnen worden.

source: This prospective member cannot be approved.
nl: Dit toekomstig lid kan niet worden goedgekeurd.

source: This renewal link could not be found. Perhaps it has been used before or has expired.
nl: Deze verlengingslink kon niet gevonden worden. Wellicht is deze eerder gebruikt of reeds verlopen.

source: To pay the membership fee you must accept Stripe's privacy policy.
nl: Om de lidmaatschapsbijdrage te betalen, moet je het privacybeleid van Stripe accepteren.

source: Toggle Navigation
nl: Klap navigatie in/uit

source: Unable to check refund status
nl: Kan terugbetalingsstatus niet controleren

source: Unknown
nl: Onbekend

source: Update %s of %s
nl: Update %s van %s

source: Update / Renew
nl: Bijwerken / Vernieuwen

source: Update API principal
nl: API-gebruiker bijwerken

source: Update Address
nl: Adres bijwerken

source: Update with data from the TU/e
nl: Bijwerken met gegevens van de TU/e

source: Username
nl: Gebruikersnaam

source: Users
nl: Gebruikers

source: Value
nl: Waarde

source: Version
nl: Versie

source: View
nl: Toon

source: View Update Requests
nl: Update-aanvragen bekijken

source: Virt (Virtual Meeting)
nl: Virt (virtuele vergadering)

source: Wants to Receive Supremum
nl: Wil Supremum ontvangen

source: Warning: the e-mail address of the member will be updated! This will require additional changes to any mailing lists the member is added to.
nl: Waarschuwing: het e-mailadres van het lid wordt bijgewerkt! Dit vereist extra wijzigingen in alle mailinglijsten waaraan het lid is toegevoegd.

source: Was it not your intention to close the payment page? Then do not worry, <a href="%s">click here</a> to go back. Are you unable to finish the payment now? Then also do not worry, we have sent you an e-mail containing a link that allows you to go to the payment page again. Do you not want to become a member of GEWIS after all? Let us know and we will delete your details.
nl: Was het niet je bedoeling om de betaalpagina te sluiten? Maak je dan geen zorgen, <a href="%s">klik hier</a> om terug te gaan. Lukt het nu niet om de betaling af te ronden? Ook dan geen nood, we hebben je een e-mail gestuurd met een link waarmee je opnieuw naar de betaalpagina kunt gaan. Wil je toch geen lid worden van GEWIS? Laat het ons weten en we verwijderen jouw gegevens.

source: Was it not your intention to close the payment page? Then do not worry, we have sent you an e-mail containing a link that allows you to go to the payment page again. Do you not want to become a member of GEWIS after all? Let us know and we will delete your details.
nl: Was het niet je bedoeling om de betaalpagina te sluiten? Geen zorgen, we hebben je een e-mail gestuurd met een link waarmee je opnieuw naar de betaalpagina kunt gaan. Wil je toch geen lid worden van GEWIS? Laat het ons weten en we verwijderen jouw gegevens.

source: We cannot determine at this time why a 404 was generated.
nl: We kunnen op dit moment niet achterhalen waarom de pagina niet kon worden gevonden.

source: We have received your registration, once your payment is verified the secretary will approve your membership. We will let you know via e-mail when this happens.
nl: We hebben je aanmelding ontvangen, zodra je betaling is geverifieerd zal de secretaris je lidmaatschap goedkeuren. We laten je via e-mail weten wanneer dit is gebeurd.

source: We were unable to create a refund for the prospective member. Please try again later. If this error stays, contact the ApplicatieBeheerCommissie and/or treasurer for more information.
nl: We konden geen terugbetaling aanmaken voor het toekomstige lid. Probeer het later nog eens. Als deze fout blijft optreden, neem dan contact op met de ApplicatieBeheerCommissie en/of penningmeester voor meer informatie.

source: We were unable to determine whether the prospective member has already received a refund. Please try again later. If this error stays, contact the ApplicatieBeheerCommissie and/or treasurer for more information.
nl: We konden niet vaststellen of het toekomstige lid al een terugbetaling heeft ontvangen. Probeer het later nog eens. Als deze fout blijft optreden, neem dan contact op met de ApplicatieBeheerCommissie en/of penningmeester voor meer informatie.

source: Welcome! With this form you can register for a membership of GEWIS. Becoming a member of the assocation costs a one-time fee of 20 euros and your membership is valid as long as you study.
nl: Welkom! Met dit formulier kun je je aanmelden voor een lidmaatschap van GEWIS. Lid worden van de vereniging kost eenmalig 20 euro en je lidmaatschap is geldig zolang je studeert.

source: With Modifications
nl: Met wijzigingen

source: Withdraw
nl: Intrekken

source: Withdraw Key Code
nl: Sleutelcode intrekken

source: Without Modifications
nl: Zonder wijzigingen

source: Yes
nl: Ja

source: You are being redirected to %s
nl: Je wordt doorgestuurd naar %s

source: You are using a build based on commit <a target="_blank" href="https://github.com/GEWIS/gewisdb/commit/%1$s">%1$s</a>. Please include this in all your bug reports.
nl: Je gebruikt een build gebaseerd op commit <a target="_blank" href="https://github.com/GEWIS/gewisdb/commit/%1$s">%1$s</a>. Vermeld dit in al je bugrapporten.

source: You can always read the online Supremum on %s.
nl: Je kunt altijd de Supremum online lezen op %s.

source: You cannot become a member of the association without agreeing to the terms.
nl: Je kunt geen lid worden van de vereniging zonder akkoord te gaan met de voorwaarden.

source: You cannot use your TU/e (student) e-mail address because if you leave or stop studying, we can no longer reach you about important announcements.
nl: Je kunt je TU/e (studenten)e-mailadres niet gebruiken, want als je vertrekt of stopt met studeren, kunnen we je niet meer bereiken over belangrijke mededelingen.

source: You have requested renewal of your status as graduate. Within 24 hours, you will see your new expiry date <b>%1$s</b> on your member page on <a href="//%2$s">%2$s</a>.
nl: Je hebt verlenging van je status als afgestudeerde aangevraagd. Binnen 24 uur zal de einddatum <b>%1$s</b> op jouw ledenpagina van <a href="//%2$s">%2$s</a> te zien zijn.

source: You have successfully requested renewal of your status as graduate.
nl: Je hebt succesvol verlenging van je status als afgestudeerde aangevraagd.

source: You have to agree to the Articles of Association and the Internal Regulations
nl: Je moet akkoord gaan met de statuten en het huishoudelijk reglement

source: You have to consent to processing your data
nl: Je moet akkoord gaan met het verwerken van je persoonlijke data

source: Your API token is "%s". This value will NOT be shown again!
nl: Jouw API-sleutel is "%s". Deze sleutel wordt NIET opnieuw weergegeven!

source: Your TU/e-username appears to be incorrect. Ensure that it starts with a valid year and looks like: YYYYxxxx. If you believe your TU/e-username is correct, please contact the secretary.
nl: Jouw TU/e-gebruikersnaam lijkt onjuist te zijn. Zorg ervoor dat deze begint met een geldig jaartal en eruitziet als: YYYYxxxx. Als je denkt dat jouw TU/e-gebruikersnaam correct is, neem dan contact op met de secretaris.

source: Your TU/e-username should look like sYYxxxx or YYYYxxxx.
nl: Jouw TU/e-gebruikersnaam moet lijken op sYYxxxx of YYYYxxxx.

source: and
nl: en

source: as
nl: als

source: change %s
nl: wijzig %s

source: email address change pending
nl: e-mailadreswijziging gepland

source: https://gewis.nl/association/regulations
nl: https://gewis.nl/nl/vereniging/reglementen

source: mailing list subscriptions
nl: mailinglijst-registraties

source: member
nl: lid

source: member address
nl: lid-adres

source: membership expiration date
nl: einddatum lidmaatschap

source: membership type
nl: lidmaatschapstype

source: n/a
nl: n.v.t.

source: never
nl: nooit

source: optional
nl: optioneel

source: our payment provider
nl: onze betalingsprovider

source: reads as follows:
nl: luidt als volgt:

source: resolves to %s
nl: verwijst naar %s

source: synced
nl: gesynchroniseerd

source: to be created
nl: aanmaken gepland

source: to be deleted
nl: verwijderen gepland

source: ¹ DSA Pattern is the study association for students of the data science programs. The introduction week, round table discussions, and other education activities for these programs are organized by Pattern. Although you can join GEWIS, you might benefit more from joining Pattern on <a href="https://dsapattern.nl/" target="_blank">their website</a>.
nl: ¹ DSA Pattern is de studievereniging voor studenten van de data science-opleidingen. De introductieweek, kringgesprekken en andere onderwijsactiviteiten voor deze opleidingen worden georganiseerd door Pattern. Hoewel je lid kunt worden van GEWIS, heb je er misschien meer aan om lid te worden van Pattern op <a href="https://dsapattern.nl/" target="_blank">hun website</a>.
